In [2]:
import numpy as np
import pandas as pd

DataFrame은 2차원 자료구조인 DataFrame는 행과 열이 있는 테이블 데이타(Tabular Data)를 받아들이는데, 아래 예제는 그 한가지 방법으로서 열(column)을 dict의 Key로, 행(row)을 dict의 Value로 한 Dictionary 데이타를 pd.DataFrame()을 사용하여 pandas의 Data Frame 자료구조로 변환한 예이다.

In [4]:
data = {
    'year':[2016, 2017, 2018],
    'GDP rate':[2.8, 3.1,3.0],
    'GDP':['1.637M','1.73M','1.83M']
}
df = pd.DataFrame(data)
df

   year  GDP rate     GDP
0  2016       2.8  1.637M
1  2017       3.1   1.73M
2  2018       3.0   1.83M

In [7]:
values = [['당신에게 드리는 마지막 혜택!', 1],
['내일 뵐 수 있을지 확인 부탁드...', 0],
['도연씨. 잘 지내시죠? 오랜만입...', 0],
['(광고) AI로 주가를 예측할 수 있다!', 1]]
columns = ['메일 본문', '스팸 메일 유무']

df = pd.DataFrame(values, columns=columns)
df

                    메일 본문  스팸 메일 유무
0        당신에게 드리는 마지막 혜택!         1
1    내일 뵐 수 있을지 확인 부탁드...         0
2    도연씨. 잘 지내시죠? 오랜만입...         0
3  (광고) AI로 주가를 예측할 수 있다!         1

3차원 자료구조인 Panel은 Axis 0 (items), Axis 1 (major_axis), Axis 2 (minor_axis) 등 3개의 축을 가지고 있는데, Axis 0은 그 한 요소가 2차원의 DataFrame 에 해당되며, Axis 1은 DataFrame의 행(row)에 해당되고, Axis 2는 DataFrame의 열(column)에 해당된다. 아래 예제는 numpy를 사용하여 3차원 난수를 발생시킨 후, 이를 pandas.Panel() 에 적용한 예이다. 출력 결과에 보면, 2 (items) x 3 (major_axis) x 4 (minor_axis) 크기의 Panel 객체가 생성되었음을 알 수 있다. Panel 객체 p로부터 p[0]을 조회하면, Axis 0 의 첫번째 요소인 DataFrame이 출력됨을 볼 수 있다.

In [6]:
data = np.random.rand(2,3,4)
p = pd.Panel(data)
# print(p) error 
p[0]

C:\Users\ynebu\Anaconda3\envs\test\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version

TypeError: Panel() takes no arguments

In [8]:
df1 = pd.DataFrame({'Name':['Kim', 'Lee', 'Park'], 'Gender':['M', 'M', 'F'], 'Mid':[90, 85, 95]})
df1

   Name Gender  Mid
0   Kim      M   90
1   Lee      M   85
2  Park      F   95

In [10]:
df2 = pd.DataFrame({'Name':['Wolfpack', 'Ray'], 'Mid':[90, 95]})
df2

       Name  Mid
0  Wolfpack   90
1       Ray   95

In [11]:
df3 = pd.DataFrame({'Name':['Wolfpack', 'Ray'], 'Gender':['M', 'F'], 'Mid':[90, 95]})
df3

       Name Gender  Mid
0  Wolfpack      M   90
1       Ray      F   95

In [12]:
df4 = pd.DataFrame({'Name':['Lee', 'Kim', 'Park', 'Wolfpack', 'Ray'], 'PopQuiz':[80, 85, 90, 95, 95]})
df4

       Name  PopQuiz
0       Lee       80
1       Kim       85
2      Park       90
3  Wolfpack       95
4       Ray       95

In [13]:
df5 = pd.DataFrame({'Name':['Kim', 'Lee', 'Wolfpack', 'Ray'], 'Final':[90, 85, 95, 95]})
df5

       Name  Final
0       Kim     90
1       Lee     85
2  Wolfpack     95
3       Ray     95

## 가로 합치기 df.concat([df1, df2], axis=0, join='outer')
- axis: 행 혹은 열 합치기 1=열 합치기
- join: outer=합치기, inner=교집합

#### 두 데이터프레임이 공통변수가 동일한 경우 pd.concat([df1, df2])
- df1.append(df2)와 동일

#### 두 데이터프레임 변수가 다른 경우 없는것은 결측치

#### 두 데이터프레임이 공통적으로 있는 변수 합치기 join='inner'

In [14]:
pd.concat([df1, df2])

       Name Gender  Mid
0       Kim      M   90
1       Lee      M   85
2      Park      F   95
0  Wolfpack    NaN   90
1       Ray    NaN   95

In [15]:
df1.append(df2)

       Name Gender  Mid
0       Kim      M   90
1       Lee      M   85
2      Park      F   95
0  Wolfpack    NaN   90
1       Ray    NaN   95

In [17]:
pd.concat([df1, df2], join='inner')

       Name  Mid
0       Kim   90
1       Lee   85
2      Park   95
0  Wolfpack   90
1       Ray   95

## 가로 합치기 df.concat([df1, df2], axis=1, join='outer')
두 데이터프레임 세로 병렬합치기
- join = 'outer' (합집합 합치기) - 디폴트: 행 개수가 적은 경우 NaN 결측치
- join = 'inner' (교집합 합치기) - 행 개수가 적은 데이터 프레임 행 개수만 저장

In [18]:
pd.concat([df3, df1], axis=1)

       Name Gender   Mid  Name Gender  Mid
0  Wolfpack      M  90.0   Kim      M   90
1       Ray      F  95.0   Lee      M   85
2       NaN    NaN   NaN  Park      F   95

In [19]:
pd.concat([df3, df1], axis=1, join='inner')

       Name Gender  Mid Name Gender  Mid
0  Wolfpack      M   90  Kim      M   90
1       Ray      F   95  Lee      M   85

## 세로 합치지 merge - pd.merge(left, right, how='inner', on=None)
- on=[['키변수1', '키변수2']] 데이테프레임 합치는 매칭 키 변수 지정, 없으면 병렬 합치기
- how: inner(교집합), outer(합집합), left(왼쪽 데이터 프레임 키변수 사용), right(오른쪽 데이터 프레임 키변수 사용)

In [20]:
df0=pd.concat([df1, df3])
df0

       Name Gender  Mid
0       Kim      M   90
1       Lee      M   85
2      Park      F   95
0  Wolfpack      M   90
1       Ray      F   95

In [21]:
pd.merge(df0, df5, on='Name')

       Name Gender  Mid  PopQuiz
0       Kim      M   90       85
1       Lee      M   85       80
2      Park      F   95       90
3  Wolfpack      M   90       95
4       Ray      F   95       95

In [22]:
pd.merge(df0, df5, how='outer', on='Name')

       Name Gender  Mid  Final
0       Kim      M   90   90.0
1       Lee      M   85   85.0
2      Park      F   95    NaN
3  Wolfpack      M   90   95.0
4       Ray      F   95   95.0

예제코드 부분 추가
http://wolfpack.hannam.ac.kr/Stat_Notes/softwares/Python/%ED%8C%8C%EC%9D%B4%EC%8D%AC_Pandas%ED%95%A9%EC%B9%98%EA%B8%B0.pdf

판다스 dataframe과 series 행 갯수 세는 방법
https://rfriend.tistory.com/450

numpy to pandas dataframe

In [4]:
import numpy as np
import pandas as pd

# Set the seed for a reproducible sample
np.random.seed(0)  

df = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])

print(df)

          A         B         C
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
2  0.950088 -0.151357 -0.103219
3  0.410599  0.144044  1.454274
4  0.761038  0.121675  0.443863